"use client";

import React from "react";

const TermsPage = () => {
  return (
    <div>
      Pinecone Food delivery нь Pinecone Academy компанийн интернэт худалдааны
      албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
      үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад
      оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
      үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
      хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд Pinecone Academy
      /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
      хяналт тавина. Pinecone Food delivery нь Pinecone Academy компанийн
      интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
      вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
      зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
      вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн
      дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд Pinecone Academy
      /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
      хяналт тавина. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
      үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
      хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд Pinecone Academy
      /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
      хяналт тавина. Pinecone Food delivery нь Pinecone Academy компанийн
      интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
      вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
      зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
      вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн
      дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд Pinecone Academy
      /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
      хяналт тавина. Pinecone Food delivery нь Pinecone Academy компанийн
      интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
      вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
      зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
      вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн
      дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд Pinecone Academy
      /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
      хяналт тавина. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
      үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
      хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд Pinecone Academy
      /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
      хяналт тавина.
    </div>
  );
};

export default TermsPage;
